# Visualizing Titanic Data

![titanic picture from wikipedia](https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/RMS_Titanic_3.jpg/600px-RMS_Titanic_3.jpg)

In [1]:
# first, need our imports and to grab the data
import pandas as pd

In [2]:
ls # what's in the data?

00-Orientation.pdf
01-WhatIsDataScience.pdf
02-Terminal-Git-Github.pdf
03-Python-Loops-and-Functions.ipynb
04-Pandas-Introduction.ipynb
05-Pandas-Practice.ipynb
06-Data-Visualization.pdf
06-Visualization-with-Matplotlib-and-Seaborn.ipynb
Week1-PythonReview/
Week2-PythonChallenge/
complete-notebooks/
data/
images/

### What are the most common last names?

Wait, the last names are part of the full name column... first we'll need to grab the last names!

A few ways we can do this:

In [3]:
# Need to grab last names ... but how?
df = pd.read_csv('data/titanic.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
df['Name'].map(lambda x: x.split(sep=',')[0])

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

`groupby` or `value_counts`?

In [14]:
df['Last Name'] = [name[0] for name in df['Name'].str.split(",")]

In [15]:
df.groupby(by = 'Last Name').count()[]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Last Name,,,,,,,,,,,,
Abbing,1,1,1,1,1,1,1,1,1,1,0,1
Abbott,2,2,2,2,2,2,2,2,2,2,0,2
Abelson,2,2,2,2,2,2,2,2,2,2,0,2
Adahl,1,1,1,1,1,1,1,1,1,1,0,1
Adams,1,1,1,1,1,1,1,1,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
de Mulder,1,1,1,1,1,1,1,1,1,1,0,1
de Pelsmaeker,1,1,1,1,1,1,1,1,1,1,0,1
del Carlo,1,1,1,1,1,1,1,1,1,1,0,1
van Billiard,1,1,1,1,1,1,1,1,1,1,0,1
van Melkebeke,1,1,1,1,1,0,1,1,1,1,0,1

Now let's visualize:

In [ ]:
# Plot a bar graph of the most common last names

### Who Paid the Most Fare?

As always - a few ways we can do this: `.loc` versus `sort_values`

And let's visualize some more!

In [ ]:
# Plot a histogram - but now, let's do all fares

In [ ]:
# Okay that's pretty bland, let's see if we can add more detail

## Seaborn 

![Sam Seaborn from West Wing, image from the TV guide](https://tvguide1.cbsistatic.com/i/2017/01/07/0f1a6ab5-8c63-4869-9f85-5d8b2b14913b/cf2e9396152ee85468e5bcfe063053a4/010717-west-wing-rob-lowe-news.jpg)

[Seaborn, I choose you!](https://elitedatascience.com/python-seaborn-tutorial) (aka an excellent exploration of the functionality of Seaborn)

Now let's practice with Seaborn:

In [ ]:
import seaborn as sns
sns.set(style='darkgrid')
# Same as sns.set_style('darkgrid')

In [ ]:
# We've mentioned pairplots, let's take a look...

In [ ]:
# Try out a swarm plot with class and age

In [ ]:
# Let's try a categorical plot (used to be a factor plot)
# Do the same swarmplot, but now make columns of survived